# Pandas [Operations](https://pandas.pydata.org/docs/user_guide/basics.html)
There are lots of useful operations built into pandas here's a look at some of the most common

In [18]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

The [.head()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.head.html) method returns the first n rows
n=5 by default

In [11]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

The [.unique()](https://pandas.pydata.org/docs/reference/api/pandas.Series.unique.html) method returns an array of unique values **for a series** in order of apperance

In [4]:
df['col2'].unique()

array([444, 555, 666])

The [.nunique()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.nunique.html) method returns a series with number of unique elements

In [6]:
df['col2'].nunique()

3

In [7]:
df.nunique()

col1    4
col2    3
col3    4
dtype: int64

The [.value_counts()](https://pandas.pydata.org/docs/reference/api/pandas.Series.value_counts.html) returns a series containing counts of unique values

In [9]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

## Selecting data
Reminder: you can use conditional selection to filter a dataframe

In [15]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [16]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)] # creates a new DataFrame with all rows from df where col1 is greater than 2 and col2 is equal to 444

In [14]:
newdf

   col1  col2 col3
3     4   444  xyz

## [.apply()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html) method
the apply method allows you to apply a function to a DataFrame

In [17]:
# this is a very simple function as an example that multiplies by two
def times2(x):
    return x*2

In [18]:
df['col1'].apply(times2)    #this will broadcast that function to every element in the column

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [19]:
df['col3'].apply(len)   # use a builtin python function to return the length of each string in col3

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [21]:
df['col2'].apply(lambda x: x/10)    # you can also pass lambda functions to the .apply() method

0    44.4
1    55.5
2    66.6
3    44.4
Name: col2, dtype: float64

## [.drop()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop.html) method
the drop method allows you to remove columns (axis=1) or rows (axis=0) from DataFrames

In [3]:
df.drop('col1',axis=1)  #drop col1 from the DataFrame

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

## find column names of a DataFrame

In [4]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

## find index of a DataFrame

In [5]:
df.index

RangeIndex(start=0, stop=4, step=1)

## Sorting and ordering a DataFrame with [.sort_values()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html)

In [6]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
df.sort_values(by='col2')  #sort DataFrame by col2, DataFrame index remains intact

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

## Find null values with [.isnull()](https://pandas.pydata.org/docs/reference/api/pandas.isnull.html)
Returns a boolean if DataFrame element has a Null/NaN value

In [10]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

## Fill in missing values with [.fillna()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html)

In [12]:
# Create a DataFrame with missing values
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [13]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

## Create pivot tables with [.pivot_table()](https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html)
This will be familiar to excel users

In [15]:
# Create a new DataFrame
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [16]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [17]:
df.pivot_table(values = 'D', index=['A','B'], columns=['C'])    # Create a pivot table with A and B as indices, values from D as data points, and columns from C values

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN